In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
url = "https://statbase.org/datasets/tourism-and-leisure/theme-parks-attendance/?syear=2023&frmreq=0&sproc=proc&filter=&sort="
resp = requests.get(url)
resp.raise_for_status()  # para asegurarnos de que la petición fue exitosa
html = resp.text

In [3]:
soup = BeautifulSoup(html, "html.parser")

# Supongamos que los datos están en un <table>…
table = soup.find("table")
soup = BeautifulSoup(resp.text, "html.parser")

In [4]:
rows = soup.find_all("div", class_="it_row")
all_data = []
for row in rows:
    # dentro de la fila, buscar todas las “celdas”
    cells = row.find_all("div", class_="it_cell")
    row_vals = []
    for c in cells:
        text = c.get_text(strip=True)
        row_vals.append(text)
    all_data.append(row_vals)

# Convertir a dataframe
asistencia_parques = pd.DataFrame(all_data)
print(asistencia_parques.head())

                                                   0         1     2
0                                             Object  share, %  Rank
1  MAGIC KINGDOM THEME PARK AT WALT DISNEY WORLD ...      4.79     1
2      DISNEYLAND PARK AT DISNEYLAND RESORT, ANAHEIM      4.66     2
3                     UNIVERSAL STUDIOS JAPAN, OSAKA      4.33     3
4     TOKYO DISNEYLAND AT TOKYO DISNEY RESORT, TOKYO      4.08     4

In [5]:
asistencia_parques

                                                    0         1     2
0                                              Object  share, %  Rank
1   MAGIC KINGDOM THEME PARK AT WALT DISNEY WORLD ...      4.79     1
2       DISNEYLAND PARK AT DISNEYLAND RESORT, ANAHEIM      4.66     2
3                      UNIVERSAL STUDIOS JAPAN, OSAKA      4.33     3
4      TOKYO DISNEYLAND AT TOKYO DISNEY RESORT, TOKYO      4.08     4
..                                                ...       ...   ...
66                           FANTASIALANDIA, SANTIAGO      0.26    63
67                       MUNDO PETAPA, GUATEMALA CITY      0.25    64
68            THEME PARQUE NACIONAL DEL CAFÉ, QUINDIO      0.23    65
69                   PARQUE DE LA COSTA, BUENOS AIRES      0.17    66
70                          EL SALITRE MAGICO, BOGOTÁ      0.16    67

[71 rows x 3 columns]

In [6]:
asistencia_parques.columns = ['Nombre del Parque', 'share, %', "Rank"]

In [42]:
response = requests.get(url)
soup = BeautifulSoup(response.content, 'html.parser')

# Encontrar las filas de la tabla
rows = soup.find_all('div', class_='it_row')

# Inicializar listas para almacenar los datos
parques = []
ubicaciones = []
for row in rows:
    # Extraer la primera celda que contiene el nombre y ubicación
    cell = row.find('div', class_='it_cell')
    if cell:
        # Obtener el texto de la celda
        texto = cell.get_text(strip=True)
        # Separar el nombre del parque y la ubicación por la coma
        if ',' in texto:
            nombre_parque, ubicacion = texto.rsplit(',', 1)
            parques.append(nombre_parque.strip())
            ubicaciones.append(ubicacion.strip())
        else:
            parques.append(texto)
            ubicaciones.append('Desconocido')

# Crear un DataFrame con los datos
ubicaciones = pd.DataFrame({
    'Nombre del Parque': parques,
    'Ubicación (País)': ubicaciones
})

In [43]:
asistencia_parques

                                    Nombre del Parque  share, %  Rank
0                                              object  share, %  Rank
1   magic kingdom theme park at walt disney world ...      4.79     1
2       disneyland park at disneyland resort, anaheim      4.66     2
3                      universal studios japan, osaka      4.33     3
4      tokyo disneyland at tokyo disney resort, tokyo      4.08     4
..                                                ...       ...   ...
66                           fantasialandia, santiago      0.26    63
67                       mundo petapa, guatemala city      0.25    64
68            theme parque nacional del café, quindio      0.23    65
69                   parque de la costa, buenos aires      0.17    66
70                          el salitre magico, bogotá      0.16    67

[71 rows x 3 columns]

In [9]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [10]:
# URL de la página con los datos
url = 'https://statbase.org/datasets/tourism-and-leisure/theme-parks-attendance/'

# Realizar la solicitud HTTP
response = requests.get(url)
soup = BeautifulSoup(response.content, 'html.parser')

# Encontrar las filas de la tabla
rows = soup.find_all('div', class_='it_row')

# Inicializar listas para almacenar los datos
parques = []
ubicaciones = []

# Iterar sobre cada fila para extraer los datos
for row in rows:
    # Extraer la primera celda que contiene el nombre y ubicación
    cell = row.find('div', class_='it_cell')
    if cell:
        # Obtener el texto de la celda
        texto = cell.get_text(strip=True)
        # Separar el nombre del parque y la ubicación por la coma
        if ',' in texto:
            nombre_parque, ubicacion = texto.rsplit(',', 1)
            parques.append(nombre_parque.strip())
            ubicaciones.append(ubicacion.strip())
        else:
            parques.append(texto)
            ubicaciones.append('Desconocido')

# Crear un DataFrame con los datos
ubicaciones = pd.DataFrame({
    'Nombre del Parque': parques,
    'Ubicación (País)': ubicaciones
})

In [11]:
ubicaciones

                                    Nombre del Parque  Ubicación (País)
0                                              Object       Desconocido
1   MAGIC KINGDOM THEME PARK AT WALT DISNEY WORLD ...  LAKE BUENA VISTA
2                DISNEYLAND PARK AT DISNEYLAND RESORT           ANAHEIM
3                             UNIVERSAL STUDIOS JAPAN             OSAKA
4             TOKYO DISNEYLAND AT TOKYO DISNEY RESORT             TOKYO
..                                                ...               ...
66                                     FANTASIALANDIA          SANTIAGO
67                                       MUNDO PETAPA    GUATEMALA CITY
68                     THEME PARQUE NACIONAL DEL CAFÉ           QUINDIO
69                                 PARQUE DE LA COSTA      BUENOS AIRES
70                                  EL SALITRE MAGICO            BOGOTÁ

[71 rows x 2 columns]

In [18]:
ubicaciones['Nombre del Parque'] = ubicaciones['Nombre del Parque'].str.strip().str.lower()
asistencia_parques['Nombre del Parque'] = asistencia_parques['Nombre del Parque'].str.strip().str.lower()

In [34]:
parques = pd.merge(
    ubicaciones,
    asistencia_parques,
    on='Nombre del Parque',
    how='outer'
)

In [35]:
parques

                            Nombre del Parque Ubicación (País) share, % Rank
0                                alton towers    STAFFORDSHIRE      NaN  NaN
1                 alton towers, staffordshire              NaN     0.64   50
2                          beto carrero world   SANTA CATARINA      NaN  NaN
3          beto carrero world, santa catarina              NaN     0.75   47
4                     busch gardens tampa bay            TAMPA      NaN  NaN
..                                        ...              ...      ...  ...
134          warner bros abu dhabi, abu dhabi              NaN     0.47   56
135             zhengzhou fantawild adventure        ZHENGZHOU      NaN  NaN
136  zhengzhou fantawild adventure, zhengzhou              NaN      1.2   26
137             zigong fantawild dino kingdom           ZIGONG      NaN  NaN
138     zigong fantawild dino kingdom, zigong              NaN     1.31   23

[139 rows x 4 columns]

In [40]:
# Ordenar por 'Share' de mayor a menor
ordenado = parques.sort_values(by='share, %', ascending=False)

# Quedarte con las primeras 10 filas (top 10)
top10_paises = ordenado.head(10).reset_index(drop=True)

In [41]:
top10_paises

,Nombre del Parque,Ubicación (País),"share, %",Rank
0,object,Desconocido,"share, %",Rank
1,magic kingdom theme park at walt disney world ...,NaN,4.79,1
2,"disneyland park at disneyland resort, anaheim",NaN,4.66,2
3,"universal studios japan, osaka",NaN,4.33,3
4,"tokyo disneyland at tokyo disney resort, tokyo",NaN,4.08,4
5,"shanghai disneyland at shanghai disney resort,...",NaN,3.79,5
6,"chimelong ocean kingdom, hengqin",NaN,3.38,6
7,"tokyo disneysea at tokyo disney resort, tokyo",NaN,3.35,7
8,"epcot at walt disney world, lake buena vista",NaN,3.24,8
9,"disneyland park at disneyland paris, marne-la-...",NaN,2.81,9

In [48]:
pip install selenium

Collecting selenium
  Downloading selenium-4.37.0-py3-none-any.whl (9.7 MB)
     ---------------------------------------- 9.7/9.7 MB 11.3 MB/s eta 0:00:00
Requirement already satisfied: urllib3[socks]<3.0,>=2.5.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from selenium) (2.5.0)
Collecting trio<1.0,>=0.31.0
  Downloading trio-0.31.0-py3-none-any.whl (512 kB)
     ------------------------------------- 512.7/512.7 kB 16.2 MB/s eta 0:00:00
Collecting trio-websocket<1.0,>=0.12.2
  Downloading trio_websocket-0.12.2-py3-none-any.whl (21 kB)
Requirement already satisfied: certifi>=2025.10.5 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from selenium) (2025.10.5)
Requirement already satisfied: typing_extensions<5.0,>=4.15.0 in c:\users\noeli\appdata\roaming\python\python311\site-packages (from selenium) (4.15.0)
Collecting websocket-client<2.0,>=1.8.0
  Downloading websocket_client-1.9.0-py3-none-any.whl (82 kB)
     ---------------------------------------- 82.6/82.6 kB 4.8 MB/s eta 0:00:00
Collecting attrs>=23.2.0
  Downloading attrs-25.4.0-py3-none-any.whl (67 kB)
     ---------------------------------------- 67.6/67.6 kB ? eta 0:00:00
Collecting sortedcontainers
  Downloading sortedcontainers-2.4.0-py2.py3-none-any.whl (29 kB)
Requirement already satisfied: idna in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio<1.0,>=0.31.0->selenium) (3.11)
Collecting outcome
  Downloading outcome-1.3.0.post0-py2.py3-none-any.whl (10 kB)
Collecting sniffio>=1.3.0
  Downloading sniffio-1.3.1-py3-none-any.whl (10 kB)
Collecting cffi>=1.14
  Downloading cffi-2.0.0-cp311-cp311-win_amd64.whl (182 kB)
     ------------------------------------- 182.8/182.8 kB 11.5 MB/s eta 0:00:00
Collecting wsproto>=0.14
  Downloading wsproto-1.2.0-py3-none-any.whl (24 kB)
Collecting pysocks!=1.5.7,<2.0,>=1.5.6
  Downloading PySocks-1.7.1-py3-none-any.whl (16 kB)
Collecting pycparser
  Downloading pycparser-2.23-py3-none-any.whl (118 kB)
     -------------------------------------- 118.1/118.1 kB 6.7 MB/s eta 0:00:00
Collecting h11<1,>=0.9.0
  Downloading h11-0.16.0-py3-none-any.whl (37 kB)
Installing collected packages: sortedcontainers, websocket-client, sniffio, pysocks, pycparser, h11, attrs, wsproto, outcome, cffi, trio, trio-websocket, selenium
Successfully installed attrs-25.4.0 cffi-2.0.0 h11-0.16.0 outcome-1.3.0.post0 pycparser-2.23 pysocks-1.7.1 selenium-4.37.0 sniffio-1.3.1 sortedcontainers-2.4.0 trio-0.31.0 trio-websocket-0.12.2 websocket-client-1.9.0 wsproto-1.2.0
Note: you may need to restart the kernel to use updated packages.

  WARNING: The script wsdump.exe is installed in 'c:\Users\noeli\AppData\Local\Programs\Python\Python311\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.

[notice] A new release of pip available: 22.3 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [87]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

url = "https://blog.europa.jobs/es/art-salario-minimo-en-europa-en-2025/"

response = requests.get(url)
response.raise_for_status()

soup = BeautifulSoup(response.text, 'html.parser')

# Encontrar todas las tablas de la página
tables = soup.find_all('table')
print(f"Se encontraron {len(tables)} tablas.")

dfs = []

for i, table in enumerate(tables):
    rows = table.find_all('tr')
    
    # Obtener encabezados si existen
    headers = [th.get_text(strip=True) for th in rows[0].find_all(['th', 'td'])]
    
    data = []
    for row in rows[1:]:
        cols = row.find_all('td')
        if len(cols) == 0:
            continue
        data.append([col.get_text(strip=True) for col in cols])
    
    salario_minimo = pd.DataFrame(data, columns=headers)
    dfs.append(salario_minimo)
    
    print(f"Tabla {i+1}:")
    print(df.head())
    print("\n" + "="*40 + "\n")

# Ahora dfs es una lista con todos los DataFrames de cada tabla

Se encontraron 4 tablas.
Tabla 1:
    Grupo I     Salario mínimo
0  Bulgaria         550,66 EUR
1   Hungría  773,90/883,82 EUR
2   Letonia            740 EUR

========================================

Tabla 2:
    Grupo I     Salario mínimo
0  Bulgaria         550,66 EUR
1   Hungría  773,90/883,82 EUR
2   Letonia            740 EUR

========================================

Tabla 3:
    Grupo I     Salario mínimo
0  Bulgaria         550,66 EUR
1   Hungría  773,90/883,82 EUR
2   Letonia            740 EUR

========================================

Tabla 4:
    Grupo I     Salario mínimo
0  Bulgaria         550,66 EUR
1   Hungría  773,90/883,82 EUR
2   Letonia            740 EUR

========================================

In [94]:
dfs[0]

    Grupo I     Salario mínimo
0  Bulgaria         550,66 EUR
1   Hungría  773,90/883,82 EUR
2   Letonia            740 EUR

In [101]:
dfs[0].rename(columns={
    "Grupo I":"País",
}, inplace=True)

In [93]:
dfs[1]

          Grupo II Salario mínimo
0          Rumanía     814,49 EUR
1           Grecia        968 EUR
2          Croacia        970 EUR
3  República Checa      823,3 EUR
4          Estonia        886 EUR
5            Malta     961,05 EUR
6       Eslovaquia        816 EUR

In [102]:
dfs[1].rename(columns={
    "Grupo II":"País",
}, inplace=True)

In [95]:
dfs[2]

   Grupo III Salario mínimo
0    Polonia    1085,57 EUR
1   Portugal       1015 EUR
2   Lituania       1038 EUR
3  Eslovenia    1253,36 EUR
4     España       1323 EUR
5    Francia    1801,80 EUR

In [103]:
dfs[2].rename(columns={
    "Grupo III":"País",
}, inplace=True)

In [96]:
dfs[3]

       Grupo IV Salario mínimo
0      Alemania       2222 EUR
1       Bélgica    2029,88 EUR
2  Países Bajos       2437 EUR
3       Irlanda    2281,50 EUR
4    Luxemburgo    2637,77 EUR

In [104]:
dfs[3].rename(columns={
    "Grupo IV":"País",
}, inplace=True)

In [105]:
salario_minimo_europa = pd.concat(dfs, ignore_index=True, sort=False)

In [106]:
salario_minimo_europa

               País     Salario mínimo
0          Bulgaria         550,66 EUR
1           Hungría  773,90/883,82 EUR
2           Letonia            740 EUR
3           Rumanía         814,49 EUR
4            Grecia            968 EUR
5           Croacia            970 EUR
6   República Checa          823,3 EUR
7           Estonia            886 EUR
8             Malta         961,05 EUR
9        Eslovaquia            816 EUR
10          Polonia        1085,57 EUR
11         Portugal           1015 EUR
12         Lituania           1038 EUR
13        Eslovenia        1253,36 EUR
14           España           1323 EUR
15          Francia        1801,80 EUR
16         Alemania           2222 EUR
17          Bélgica        2029,88 EUR
18     Países Bajos           2437 EUR
19          Irlanda        2281,50 EUR
20       Luxemburgo        2637,77 EUR

In [112]:
# 1. Limpiar la columna de salarios (si tiene símbolos o texto como €)
salario_minimo_europa['Salario mínimo'] = (
    salario_minimo_europa['Salario mínimo']
    .str.replace(r'[^\d,.-]', '', regex=True)   # elimina € u otros caracteres
    .str.replace(',', '.')                     # cambia coma decimal por punto
)

# 2. Convertir a float (forzamos errores como NaN si hay algo raro)
salario_minimo_europa['Salario mínimo'] = pd.to_numeric(salario_minimo_europa['Salario mínimo'], errors='coerce')

# 3. Ordenar de mayor a menor
último_salario = salario_minimo_europa.sort_values(by='Salario mínimo', ascending=False)

In [114]:
último_salario

               País  Salario mínimo
20       Luxemburgo         2637.77
18     Países Bajos         2437.00
19          Irlanda         2281.50
16         Alemania         2222.00
17          Bélgica         2029.88
15          Francia         1801.80
14           España         1323.00
13        Eslovenia         1253.36
10          Polonia         1085.57
12         Lituania         1038.00
11         Portugal         1015.00
5           Croacia          970.00
4            Grecia          968.00
8             Malta          961.05
7           Estonia          886.00
6   República Checa          823.30
9        Eslovaquia          816.00
3           Rumanía          814.49
2           Letonia          740.00
0          Bulgaria          550.66
1           Hungría             NaN

In [115]:
top_10_salario = último_salario.head(10)

In [116]:
top_10_salario

            País  Salario mínimo
20    Luxemburgo         2637.77
18  Países Bajos         2437.00
19       Irlanda         2281.50
16      Alemania         2222.00
17       Bélgica         2029.88
15       Francia         1801.80
14        España         1323.00
13     Eslovenia         1253.36
10       Polonia         1085.57
12      Lituania         1038.00